back-end/app/controllers/api/v1/playlists_controller.rb

  def index
    render json: Playlist.all
---
SELECT "playlists".* FROM "playlists"

  def create
    playlist = Playlist.create(playlist_params)
---
INSERT INTO "playlists" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "second "], ["created_at", "2018-06-13 19:16:00.385232"], ["updated_at", "2018-06-13 19:16:00.385232"]]

  def set_playlist
    @playlist = Playlist.find(params[:id])
---
SELECT  "playlists".* FROM "playlists" WHERE "playlists"."id" = $1 LIMIT $2  [["id", 28], ["LIMIT", 1]]