back-end/app/controllers/api/v1/tracks_controller.rb

  def index

    render json: Track.all
---
SELECT "tracks".* FROM "tracks"

  def create
    track = Track.create(track_params)
---
INSERT INTO "tracks" ("title", "artist", "release", "created_at", "updated_at", "url", "description", "duration", "label", "catno", "playlist_id", "resource_url", "imgurl") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13) RETURNING "id"

  def set_track
    @track = Track.find(params[:id])
---
SELECT  "tracks".* FROM "tracks" WHERE "tracks"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]